#С помощью использования **лямбд, filter, map, zip, enumerate, list comprehension

#Задайте список из нескольких чисел. 
# Напишите программу, которая найдёт сумму элементов списка, стоящих на позиции с нечетным индексом

#import random
#my_list = [random.randint(0,100) for i in range (int(input('Введите количество элементов списка: ')))]
#print(my_list)
#odd_sum =sum(my_list[1::2])
#print (odd_sum)

#Напишите программу, которая принимает на вход вещественное число и показывает сумму цифр
#import functools
#str = input('Введите число: ')
#data = list(map(int, str.replace(',','')))
#sum = functools.reduce((lambda a, b: a+b), data)
#print (sum)
